app/controllers/pictures_controller.rb

def index
  @user = current_user
  @pictures = @user.pictures.order(id: :desc)
  @showdetail = false
  if params[:showdetail]
    @showdetail = true
  end

  @showlogin = false
  if params[:logout]
    @showlogin = true
  end

  if params[:fav]
    @picture = Picture.find(params[:fav])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = $1 ORDER BY "pictures"."id" DESC  [["user_id", 1]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

def show
   @picture = Picture.find(params[:id])
   if params[:get_task]
     @task_id = @picture.get_task
     @picture.update(:task_id => @task_id)
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "task_id" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["task_id", 269751931], ["updated_at", 2017-03-01 00:44:34 UTC], ["id", 1]]

def create
   @user = current_user
   @picture = Picture.new(picture_params)
   if @picture.save
---
INSERT INTO "pictures" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdasdf"], ["description", ""], ["user_id", 1], ["created_at", 2017-03-06 18:45:34 UTC], ["updated_at", 2017-03-06 18:45:34 UTC]]

def edit
   @picture = Picture.new
   @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

def update
  @picture = Picture.find(params[:id])
    if @picture.update(picture_params)
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "pictures" SET "title" = $1, "description" = $2, "body" = $3, "legs" = $4, "feet" = $5, "hands" = $6, "updated_at" = $7 WHERE "pictures"."id" = $8  [["title", "Classic"], ["description", "Cozy"], ["body", "Red"], ["legs", "Black"], ["feet", "Green"], ["hands", "Leather"], ["updated_at", 2017-03-07 21:55:46 UTC], ["id", 37]]